/* Возвращает координаты ([строка, столбец]) элемента,
который отличается от остальных. Строки и столбцы
проиндексированы на 1 (не с нулевой индексацией). */

whereIsWaldo([
    ["A", "A", "A"],
    ["A", "A", "A"],
    ["A", "B", "A"]
]) // ➞ [3, 2]

whereIsWaldo([
    ["c", "c", "c", "c"],
    ["c", "c", "c", "d"]
]) // ➞ [2, 4]

whereIsWaldo([
    ["O", "O", "O", "O"],
    ["O", "O", "O", "O"],
    ["O", "O", "O", "O"],
    ["O", "O", "O", "O"],
    ["P", "O", "O", "O"],
    ["O", "O", "O", "O"]
]) // ➞ [5, 1]
